package com.raphael.bean;

/**
 * Created by Nov on 2015/1/6.
 * 组件
 * J2EE的核心是一组规范与指南，强调J2ee的核心概念就是组件+容器，这确实是无可厚非的.
 * 条件：
 * 1.生命周期
 * 2.持久性
 * 3.命名
 * 4.事务
 * 标准的j2ee架构
 *
 * 表示->应用->服务->域->(连通)->持久
 *
 * [j2ee基础技术]
 *  XML RMI JNDI JMS
 * [j2ee核心技术]
 *  JDBC EJB Servlet JSP
 * [j2ee其他技术]
 *  JTA JTS Java Mail
 *
 *  数据库访问和文件访问
 */
public class BeanMain {
    /*
        1、组件     主要由应用开发人员完成，用来  [实现应用系统的功能]

             _______________________________________________________________________________
            |  2、容器     有两个主要的功能：一是  [提供组件运行环境]，二是  [控制组件生命周期]
服务器厂商实现|
            |  3、服务器   也有两个主要的功能：一是  [提供容器运行环境]，二是  [实现J2EE中的技术对应的规范]
             -------------------------------------------------------------------------------
     */
}
